from gtts import gTTS
import hashlib

zi = {
1 :["坝","汉","艳","扮","扬","读","摔","跤","凤","洁", ],
2 :["荒","笛","罚","假","裳", ],
3 :["背","诵","例","圈","段","糊","涂","呆","戒","厉","挨","楚", ],
4 :["径","斜","赠","残","犹","傲","君","橙","橘","挑", ],
5 :["洼","印","凌","增","棕","靴", ],
6 :["钥","匙","缤","枚","频","勾","喇","叭","厚","曲","丰", ],
7 :["抖","蟋","蟀","振","韵","掠","吟","辽","阔", ],
8 :["捡","旧","饿","卷","挣","几","燃","焰","蜡","烛","富","晃","划","喷","强", ],
9 :["缩","努","茎","锯","斧","推","吱","拆", ],
10 :["咱","偷","答","应","骨","齿","嚼","吞","胃","悲","咽","泪","眯", ],
11 :["酪","宣","处","诱","舔","毅","犯","禁","稍","豫","跺","聚","申","介","绍","宗","乙","召","孝",],
12 :["暴","喵","孵","叽","偶","尔",],
13 :["萝","卜","愁","沾","继","晾",],
14 :["吗","讨","厌","怒","批","访","担","压","差","默","模","中","弹","疯","汪","搞","轴","基","础","阁","佳","盲","唐",],
15 :["父","啦","鹦","鹉","悄",],
16 :["蒲","英","耍","欠","钓","拢",],
17 :["亦","抹","宜","庭","未","磨","盘",],
18 :["饶","优","瑰","岩","参","武","栖","粪","辈","设",],
19 :["滨","鸥","胳","臂","睬","载","凰","亚","榕","凳","逢","除",],
20 :["兴","融","侧","欣","浸","乳","梢","舍","显","材","膝","眠","库","蝌","蚪","蛾","鲤","鲫","鲨",],
21 :["妙","奏","呢","喃","伟","击","汇","喳","唧","哩",],
22 :["仅","麻","旋","佩","姿","态","梨","笋","寸","副",],
23 :["黎","凝","畅","瞬","猎",],
24 :["司","跌","皆","弃","持",],
25 :["宁","胸","脯","惹","仰","渣","或","者","惜","诚",],
26 :["斗","棒","恩","大","撤","险","瓦","帘","迅","速","夺","秒",],
27 :["陈","曼","联","缸","还","粱","顿","侦","眨","瞪","瞅","眶","睹",]
}

zi2 ={
1 :[  "晨","绒","球","汉","艳","服","装","扮","静","停","孔","雀","粗"],
2 :[  "落","荒","笛","舞","狂","罚","假","互","所","够","猜","扬","臂"],
4 :[  "寒","径","斜","霜","赠","盖","菊","残","君","橙","送","挑"],
5 :[  "铺","泥","晶","院","墙","印","排","列","规","则","乱","棕","迟"],
6 :[  "盒","颜","料","票","争","仙","闻","勾","紧","洞","油","曲","丰"],
8 :[  "柴","旧","裙","怜","饿","蜡","烛","伸","忽","板","富","颗","奶"],
10 :[ "旅","咱","偷","救","命","拼","扫","胃","管","乎","咬","流","泪"],
12 :[ "准","备","等","暴","睡","壁","砍","蜘","蛛","漂","撞","饱","晒"],
15 :[ "搭","亲","父","啦","响","羽","翠","嘴","悄","吞","哦","捕"],
16 :[ "蒲","英","盛","耍","喊","欠","钓","而","察","拢","掌","趣","喜"],
17 :[ "断","楚","至","孤","帆","饮","初","镜","未","磨","遥","银","盘"],
18 :[ "优","淡","浅","错","岩","挺","刺","鼓","数","厚","宝","贵","业"],
19 :[ "滨","灰","飘","渔","遍","躺","载","靠","亚","夏","除","踩","洁"],
20 :[ "脑","袋","严","实","挡","视","线","坛","显","材","软","刮","库"],
21 :[ "妙","演","奏","琴","感","受","激","击","器","滴","敲","鸣","诉"],
22 :[ "读","虾","麻","勇","蚂","蚁","短","栽","梨","寸","柔","摇","册"],
23 :[ "朝","雾","蒙","鼻","总","抖","露","湿","吸","猎","翅","膀","重"],
24 :[ "司","庭","登","跌","众","弃","持"],
25 :[ "郊","养","粉","谷","粒","男","或","者","冻","冷","惜","肯","诚"],
26 :[ "术","斗","焰","刚","烈","离","血","仍","取","匆","险"],
}
ci = {
1 :["早晨", "穿戴", "鲜艳", "服装", "打扮", "敬爱", "国旗", "敬礼", "安静", "树枝", "好奇", "孔雀", "招引", "粗壮", "枝干", "影子"],
2 :["阵雨", "荒野", "跳舞", "狂欢", "功课", "放假", "互相", "狂风", "急急忙忙", "自然", "能够", "双臂"],
5 :["水泥", "放晴", "明朗", "亮晶晶", "金黄", "雨珠", "院墙", "落叶", "闪闪发光", "尽头", "平展", "排列", "规则", "歌唱", "迟到"],
6 :["清凉", "留意", "颜料", "枫叶", "邮票", "果树", "菊花", "仙子", "气味", "香甜", "香味", "加紧", "过冬", "丰收"],
8 :["火柴", "围裙", "可怜", "哪怕", "暖和", "蜡烛", "亮光", "忽然", "地板", "烛光", "温和", "赶紧", "痛苦", "清晨"],
10 :["旅行", "要好", "咱们", "草堆", "作声", "偷偷", "答应", "做梦", "来得及", "救命", "拼命", "大吃一惊", "消化", "当然", "几乎", "知觉", "光亮", "眼泪"],
12 :["变成", "门板", "准备", "暴风雨", "安心", "睡觉", "主人", "墙壁", "母鸡", "注意", "根本", "蜘蛛", "漂亮", "因此"],
15 :["母亲", "外祖父", "雨点", "船夫", "用力", "船头", "羽毛", "翠绿", "静悄悄", "翠鸟", "捕鱼"],
16 :["窗前", "蒲公英", "盛开", "玩耍", "一本正经", "绒毛", "假装", "哈欠", "钓鱼", "观察", "合拢", "手掌", "有趣", "喜爱"],
18 :["位于", "部分", "风景", "优美", "物产", "丰富", "相互", "交错", "成群结队", "游动", "堆积", "宝贵", "肥料", "祖国", "事业", "发展"],
19 :["海滨", "街道", "交界", "来来往往", "渔民", "遍地", "远处", "汽笛", "船队", "满载", "银光闪闪", "靠岸", "初夏", "散发", "除了", "整洁"],
20 :["东北", "脑袋", "严严实实", "挡住", "视线", "花坛", "显得", "苍翠", "飞舞", "名贵", "药材", "雪花", "巨大", "宝库"],
21 :["美妙", "音乐家", "演奏", "感受", "激动", "合奏", "乐曲", "充满", "乐器", "雨滴", "滴答", "所有", "河流", "轻快", "告诉"],
22 :["高远", "沉思", "麻雀", "蚂蚁", "搬家", "井然", "勇敢", "精神", "趣味", "鲜美", "如同", "温柔", "摇摆", "倒影", "无穷", "无尽", "乐趣"],
23 :["父亲", "童年", "雾蒙蒙", "轻声", "生怕", "惊动", "气息", "总是", "抖动", "露水", "呼吸", "时刻", "猎人", "翅膀", "沉重"],
25 :["郊外", "养病", "跳动", "欢快", "谷粒", "男孩", "或者", "严寒", "本来", "可惜", "肯定", "诚实"],
26 :["手术台", "阵地", "战斗", "打响", "气焰", "刚刚", "不断", "激烈", "眼球", "血丝", "烟雾", "仍然", "取出", "匆匆", "离开", "危险", "转告"]
}

# zi = {
# 1 :["坝","汉",],
# }
# zi2 = {
# 1 :["朝","雾",],
# }
# ci = {
# 1 :["早晨", "穿戴"],
# }
def find_words_with_char_fast_sorted(char, dict_path, max_results=10):
    results = []
    with open(dict_path, 'r', encoding='utf-8') as f:
        for line in f:
            if line.startswith('#'):
                continue
            parts = line.split(' ', 2)
            if len(parts) >= 2:
                word = parts[1].strip()
                if len(word) > 1 and char in word:
                    results.append(word)
    # 按照词语长度排序，短的优先，返回前 max_results 个
    results.sort(key=len)
    return results[:max_results]

def deal_one_zi( zi_arr , tag):
	wordlist = []
	answerlist = []
	i = 0
	for word in zi_arr :
		i = i + 1
		ciyu_arr = find_words_with_char_fast_sorted(word ,"/Users/joy/Downloads/cedict_1_0_ts_utf-8_mdbg.txt")
		if len(ciyu_arr)>= 2 :
			name1 = f"{ciyu_arr[0]}的{word}"
			name1_md5 = hashlib.md5(name1.encode('utf-8')).hexdigest()
			name2 = f"{ciyu_arr[1]}的{word}"
			name2_md5 = hashlib.md5(name2.encode('utf-8')).hexdigest()
			wordlist.append(f"{tag}{i:03}:<audiobutton id=\"{name1_md5}\" /><audiobutton id=\"{name2_md5}\" /></br>")
			answerlist.append(f"{tag}{i:03}:{word}</br>")
		elif len(ciyu_arr) == 1:
			name1 = f"{ciyu_arr[0]}的{word}"
			name1_md5 = hashlib.md5(name1.encode('utf-8')).hexdigest()
			wordlist.append(f"{tag}{i:03}:<audiobutton id=\"{name1_md5}\" /></br>")
			answerlist.append(f"{tag}{i:03}:{word}</br>")
		else :
			name1 = word
			name1_md5 = hashlib.md5(name1.encode('utf-8')).hexdigest()
			wordlist.append(f"{tag}{i:03}:<audiobutton id=\"{name1_md5}\" /></br>")
			answerlist.append(f"{tag}{i:03}:{word}</br>")
		
	wordliststr = "\n".join(wordlist)

	answerstr = "\n".join(answerlist)
	return  wordliststr , answerstr
def deal_one_ci( ci_arr , tag):
	wordlist = []
	answerlist = []
	i = 0
	for word in ci_arr :
		i = i + 1
		name_md5 = hashlib.md5(word.encode('utf-8')).hexdigest()
		wordlist.append(f"{tag}{i:03}:<audiobutton id=\"{name_md5}\" /></br>")
		answerlist.append(f"{tag}{i:03}:{word}</br>")
	wordliststr = "\n".join(wordlist)
	answerstr = "\n".join(answerlist)
	return  wordliststr , answerstr
# def deal_zi_dict(dict_zi, tag):
# 	for index, zi_arr in dict_zi.items():
# 		deal_one_zi(index , zi_arr, tag)		
# deal_zi_dict(zi , "识字")




for index in range(1, 27):
	if index in zi :
		wordliststr , answerstr = deal_one_zi(zi[index] ,"识字")
	else:
		wordliststr = ""
		answerstr = ""
	if index in zi2 :
		xiewordliststr , xieanswerstr = deal_one_zi(zi2[index] ,"写字")
	else:
		xiewordliststr , xieanswerstr = "" , ""
	if 	index in ci :
		ciwordliststr , cianswerstr = deal_one_ci(ci[index] ,"词语")
	else:
		ciwordliststr , cianswerstr = "" , ""
	content = f'''---
title: "三年级上第{index}课听写"
date: 2025-06-09
categories: [语文,听写]
tags: [听写]
format: html
---
--- ✨ 识字 ✨ ---
{wordliststr}
--- ✨ 写字 ✨ ---
{xiewordliststr}
--- ✨ 词语 ✨ ---
{ciwordliststr}
<audio id="audio-player"></audio>
<script>
function playAudio(id) {{
const audio = document.getElementById("audio-player");
audio.src = `/static/mp3/${{id}}.mp3`;
audio.play();
}}
</script>
'''
	# print(content)

	with open(f"/Users/joy/Desktop/xuwei/work/crack/tool/resign/posts/第{index}课.qmd", "w", encoding="utf-8") as f:
		f.write(content)
	content = f'''---
title: "三年级上第{index}课听写答案"
date: 2025-06-09
categories: [语文,听写,听写答案]
tags: [听写,听写答案]
format: html
---
--- ✨ 识字 ✨ ---
{answerstr}
--- ✨ 写字 ✨ ---
{xieanswerstr}
--- ✨ 词语 ✨ ---
{cianswerstr}
'''
	# print(content)
	with open(f"/Users/joy/Desktop/xuwei/work/crack/tool/resign/posts/第{index}课答案.qmd", "w", encoding="utf-8") as f:
		f.write(content)
